Return-Path: <linux-kernel-owner@vger.kernel.org>
Received: (majordomo@vger.kernel.org) by vger.kernel.org via listexpand
	id <S283010AbRK1Dnk>; Tue, 27 Nov 2001 22:43:40 -0500
Received: (majordomo@vger.kernel.org) by vger.kernel.org
	id <S281870AbRK1Dnb>; Tue, 27 Nov 2001 22:43:31 -0500
Received: from web20202.mail.yahoo.com ([216.136.226.57]:31574 "HELO
	web20202.mail.yahoo.com") by vger.kernel.org with SMTP
	id <S283010AbRK1DnV>; Tue, 27 Nov 2001 22:43:21 -0500
Message-ID: <20011128034320.95590.qmail@web20202.mail.yahoo.com>
Date: Tue, 27 Nov 2001 19:43:20 -0800 (PST)
From: GoodNews <postspisok1@yahoo.com>
To: shnizdur@yahoo.co.uk
MIME-Version: 1.0
Content-Type: text/plain; charset=us-ascii
Sender: linux-kernel-owner@vger.kernel.org
X-Mailing-List: linux-kernel@vger.kernel.org

Дорогой друг!
Извини, что отбираю твое время на чтение данного
послания,так как мы все 
устали от бесконечных рекламных рассылок и всяческого
мусора,но я надеюсь, 
что несколько минут затраченного времени смогут
окупиться, если ты решишься 
изменить свой взгляд на окружающую тебя
действительность.


Предлагается в корне изменить свою жизнь! И для этого
предназначена программа, 
реально действующая, с реальными возможностями
заработать деньги, затратив на 
это не очень большие усилия. 
Этот метод заработка денег на самом деле ДЕЙСТВУЕТ НА
100%, КОГДА УГОДНО, 
ГДЕ УГОДНО. Вы сможете заработать более 1.000.000
рублей в последующие 90 дней. 
Это не цепное письмо, а отличная легальная возможность
заработать деньги. 

Не пожалейте времени, ознакомьтесь с предлагаемой
программой, и успех и 
благополучие посетят Ваш дом!

Данное письмо придет к Вам на этот адрес один
единственный раз, больше я Вас 
не побеспокою. Но если у Вас имеются и другие адреса,
не обижайтесь, если это 
послание придет и на них,программа не может отследить 
хозяина ящика, только
факт существования адреса.

Если Вас это заинтересовало и Вы желаете больше узнать
о работе предлагаемой 
программы, Вы можете отправить данное сообщение
обратно с пометкой
"More", что бы я выслала Вам подробное описание работы
системы по Вашему
желанию, а не занимать Ваше время и не тратить Ваши
деньги на получение
вложенного документа.

Возвращенные без данной пометки письма будут, как Вы
правильно догадываетесь, 
удалятся без прочтения.

Но если Вы хотите поругаться и выпустить пар, то
пожалуйста :-)
Надеюсь, Вам станет легче :-)

Еще раз извините, что отнимаю Ваше время.
Успехов вам и всяческих благ!


__________________________________________________
Do You Yahoo!?
Yahoo! GeoCities - quick and easy web site hosting, just $8.95/month.
http://geocities.yahoo.com/ps/info1
