Return-Path: <linux-kernel-owner@vger.kernel.org>
Received: (majordomo@vger.kernel.org) by vger.kernel.org via listexpand
	id <S313604AbSDPFlX>; Tue, 16 Apr 2002 01:41:23 -0400
Received: (majordomo@vger.kernel.org) by vger.kernel.org
	id <S313605AbSDPFlW>; Tue, 16 Apr 2002 01:41:22 -0400
Received: from violet.setuza.cz ([194.149.118.97]:47879 "EHLO violet.setuza.cz")
	by vger.kernel.org with ESMTP id <S313604AbSDPFlV>;
	Tue, 16 Apr 2002 01:41:21 -0400
Subject: Re: =?ISO-8859-1?Q?=C4=C4=C7=BB=C5=CD=C0=FC=B9=AE=B0=A1?=
	=?ISO-8859-1?Q?=B1=E2=BC=FA=C0=CC=C0=FC=B1=B3=C0=B0?=
	=?ISO-8859-1?Q?=B9=D7DVD=B0=FC=B7=C3=C0=FC=B9=AE?=
	=?ISO-8859-1?Q?=A1=B1=E2=BC=FA=C0=CC=C0=FC=B1=B3=C0?= =?ISO-8859-1?Q?=B0?=
From: Frank Schaefer <frank.schafer@setuza.cz>
To: "linux-kernel@vger.kernel.org" <linux-kernel@vger.kernel.org>
In-Reply-To: <3W-SMTP-AHdvCVxZGHh003b17b0@3w-smtp-ah.korea.com>
Content-Type: text/plain; charset=ISO-8859-1
X-Mailer: Evolution/1.0 (Preview Release)
Date: 16 Apr 2002 07:41:20 +0200
Message-Id: <1018935680.385.2.camel@ADMIN>
Mime-Version: 1.0
Sender: linux-kernel-owner@vger.kernel.org
X-Mailing-List: linux-kernel@vger.kernel.org
Content-Transfer-Encoding: 8bit
X-MIME-Autoconverted: from base64 to 8bit by mangalore.zipworld.com.au id PAA06548

On Fri, 2005-06-24 at 02:00, =?ISO-8859-1?Q? =B0=AD=B5=BF=BF=AC ?=
wrote:
> ¸ŞÀÏÀº ¿øÄ¡¾ÊÀ¸½Å ºĞµé¿¡°Ô Á¤¸» ÁË¼ÛÇÕ´Ï´Ù.
> 
> ¼ö½Å°ÅºÎÇØ ÁÖ½Ã¸é Àı´ë·Î ¸ÅÀÏ º¸³»Áö ¾Ê°Ú½À´Ï´Ù.
> 
> À§ ¸ÅÀÏÀº ÀÎÅÍ³İ¿¡¼­ ÃßÃàÇÑ °ÍÀÌ¸ç ¾Æ·¡ÀÇ ±¤°í ¿Ü¿Ø »ç¿ëÇÏÁö ¾Ê½À´Ï´Ù.
> 
> 
> 
> ***********Àü¹®ÄÄÇ»ÅÍ ±â¼úÀ» ÀÌÀü ¹ŞÀ» ¸î ºĞÀ» ¸ğÁıÇÕ´Ï´Ù.*************
> 
>   **( ÄÄÇ»ÅÍ Àü¹®°¡ ±â¼úÀÌÀü ±³À° ¹× DVD°ü·Ã Àü¹®°¡ ±â¼úÀÌÀü ±³À° )**
> 
> 
> 
>        ±³  À°   ¿ø : ÄÄÇ»ÅÍ ±â¼úÁö¿øÀü¹®È¸»ç  Solid_EYE
> 
>        ¸ğ Áı ÀÎ ¿ø : 8¸í ÀÌ³» (1-Time´ç 2¸í)
> 
>        ±³ À° Àå ¼Ò : ÁöÇÏÃ¶ 2È£¼± ¼­ÃÊ¿ª   
> 
>        ¹®  ÀÇ   Ã³ : 523-7881
> 
>  
> ¸ğÁıÀÎ¿øÀº 8¸í ÀÌ³»ÀÌ¸ç ÀÚ°İÀº ¼ºº°, ¿¬·É, ÇĞ·ÂÀ» ºÒ¹® ÇÕ´Ï´Ù.  
> (±âÃÊÀûÀÎ ÄÄÇ»ÅÍ »ç¿ë¹ıÀ» ¸ğ¸£´Â ºĞÀ» À§ÇØ ±âÃÊÆÄÆ®µµ ¿î¿µÇÏ°í ÀÖ½À´Ï´Ù.)
> ±â¼úÀÌÀü ±³À°Àº 100% ½Ç¹«À§ÁÖ·Î ÁøÇàµÇ¸ç ±â¼ú ÀÌ¼ö ÈÄ °ğ¹Ù·Î ½Ç¹«¿¡ ÅõÀÔµÉ
> ¼ö ÀÖµµ·Ï ¿À·£ ÄÄÇ»ÅÍ °æ·ÂÀÇ Àü¹®°¡µéÀÌ ±ÍÇÏ¸¦ ÀÌ²ø¾î µå¸± °Í ÀÔ´Ï´Ù.    
> ¶ÇÇÑ ¿À·£ ÄÄÇ»ÅÍ ½Ç¹«°æÇèÀ» ¹ÙÅÁÀ¸·Î ±â¼ú ÀÌ¼ö ÈÄ Ã¢¾÷À» ¿øÇÏ½Ã´Â ºĞµé¿¡°Ô Ã¢¾÷
> Áöµµ±îÁö °âÇÏ°í ÀÖ½À´Ï´Ù. Ã¢¾÷(PC¹æ, ÄÄÇ»ÅÍ A/S, ÄÄÇ»ÅÍ ÇĞ¿ø, °æ¿µ, ¿î¿µÀ» 
> °èÈ¹ÇÏ½Ã´Â ºĞ)À» ÇÏ´Âµ¥ ¿Ø µ·ÀÌ ±×·¸°Ô ¸¹ÀÌ µé¾î¾ß ÇÕ´Ï±î?  °¡Àå °æÁ¦ÀûÀÌ°í 
> °¡ÀåÈ¿À² ÀûÀÎ ÄÄÇ»ÅÍºĞ¾ßÀÇ »ç¾÷À» ¿øÇÏ½Ã¸é ÀúÈñ Solid_EYEÀÇ Àü¹®°¡°úÁ¤À» ÀÌ¼ö 
> ÇÏ½Ã¸é µË´Ï´Ù.
>  
>        
>       Solid_EYEÀÇ ±â¼úÀÌÀü ±³À°Àº Å©°Ô 2°¡Áö ÆÄÆ®·Î ³ª´µ¾î Áı´Ï´Ù.
>        
>         ¢Â.  ÄÄÇ»ÅÍ Àü¹®°¡ °úÁ¤ ±³À°
> 
>         ¢Â.  DVD°ü·Ã Àü¹®°¡ °úÁ¤ ±³À°
> 
>        À§ µÎ°¡Áö ÆÄÆ®ÀÇ ÀÚ¼¼ÇÑ ±³À°³»¿ëÀº ´ÙÀ½°ú °°½À´Ï´Ù.
> 
>  
> 
> ¢Â.  ÄÄÇ»ÅÍ Àü¹®°¡ °úÁ¤ ±³À°
> 
>  : Àü¹®°¡ ±â¼úÀÌÀü±³À°Àº ÄÄÇ»ÅÍÀÇ °ÅÀÇ ¸ğµç ÀüºĞ¾ß¸¦ ¹è¿ì°Ô µË´Ï´Ù.   
>    ¸ğµç ±³À°³»¿ëÀ» ¼Ò°³ÇÏ±â´Â ¹÷Â÷¹Ç·Î °¡Àå Áß¿äÇÏ´Ù°í »ı°¢µÇ´Â ºÎºĞÀ» ¸ÕÀú
>    ¼Ò°³ÇØ µå¸®°Ú½À´Ï´Ù
>  
>   - ÇÏµå¿ş¾î
>        ±âº»ÀûÀÎ ÀüÀÚÈ¸·ÎÀÇ ¿ø¸®¿Í ÀÀ¿ë¹ı ½ÉÁö¾î ÄÄÇ»ÅÍ ÀÌ¿ÜÀÇ ÀüÀÚ ÀåºñµéÀÇ
>        ÀÛµ¿¿ø¸®±îÁö ¹è¿ì°Ô µË´Ï´Ù.
> 
>   - ¼ÒÇÁÆ® ¿ş¾î
>        ÄÄÇ»ÅÍ¿¡ »ç¿ëµÇ´Â OS ¹× ApplicationÀ» Àü¹İÀûÀ¸·Î ¹è¿ì°Ô µË´Ï´Ù.
>        DOS, Windows9x, Windows2000µîÀÇ °í±Ş»ç¿ë¹ı, ÇÊ¼öÀûÀÎ À¯Æ¿¸®Æ¼µéÀÇ 
>        »ç¿ë¹ı  µîµî ÇÑ¸¶µğ·Î ÁÁ´Ù°í »ı°¢µÇ´Â ¸ğµç ¼ÒÇÁÆ®¿ş¾îµéÀÇ »ç¿ë¹ıÀ» 
>        ¹è¿ì°Ô µË´Ï´Ù.  ±× ¿Ü¿¡ ´Ù¸¥ °÷¿¡¼­´Â Àı´ë·Î ¹è¿ï ¼ö ¾ø´Â ¼ÒÇÁÆ®¿ş¾î¸¦ 
>        ÀÌ¿ëÇÑ ÇÏµå¿ş¾îÀÇ °íÂ÷¿øÀûÀÎ Á¡°Ë¹ı ¹× ½Ã½ºÅÛ ¼³Á¤¹ıµéÀ» ¹è¿ì°Ô µË´Ï´Ù
> 
>   - ÄÄÇ»ÅÍ Á¶¸³
>        ¼¼»ó¿¡¼­ °¡Àå ÁÁÀº ÄÄÇ»ÅÍ´Â ÀÚ½ÅÀÌ Á÷Á¢¸¸µç ÄÄÇ»ÅÍÀÔ´Ï´Ù.
>        Àü¹®°¡´Â ÄÄÇ»ÅÍ¸¦ »çÁö ¾Ê½À´Ï´Ù.  ´Ù¸¸ ºÎÇ°¸¸ »ì »ÓÀÔ´Ï´Ù.
>        ±âÁ¸°ú´Â ÀüÇô´Ù¸¥ ±â¼ú±â¹İÀ» µĞ Á¶¸³¹ıÀ» Ã³À½ºÎÅÍ ³¡±îÁö
> 
>   - ÄÄÇ»ÅÍ À¯Áö º¸¼ö
>        ÄÄÇ»ÅÍ À¯Áö, º¸¼ö´Â ¼ÒÇÁÆ®¿ş¾î ¹× ÇÏµå¿ş¾î¿¡ ÇØ¹ÚÇÑ Àü¹®Áö½ÄÀ»
>        °¡Áö°í ÀÖ¾î¾ß¸¸ ÇÏ¸ç Àû¾îµµ 10³âÀÌ»óÀÇ °æ·ÂÀÚÀÌ¾î¾ß ¼÷´ŞµÈ »ç¶÷
>        ÀÌ¶ó°í ÇÒ ¼ö ÀÖ½À´Ï´Ù.  Solid_EYE°¡ ´Ü±â°£¿¡ ¿©·¯ºĞÀ» 10³â ÀÌ»óµÈ
>        °æ·Â¼ÒÀ¯ÀÚ·Î ¸¸µé¾î µå¸± °ÍÀÔ´Ï´Ù.
> 
>       ***** ³î¶óÁö ¸¶½Ê½Ã¿À. ÇÏµåµğ½ºÅ© ¼ö¸®¹ıµµ ¹è¿ì°Ô µÉ°Ì´Ï´Ù  *****
> 
>   - ³×Æ®¿öÅ© ÀÎÅÍ³İ
>        ÃÖ±Ùµé¾î ³×Æ®¿öÅ©¾ø´Â ÄÄÇ»ÅÍ´Â ¹«¿ëÁö¹°ÀÏ ¸¸Å­ ÇÊ¼öÀûÀÔ´Ï´Ù.
>          ¨ç °¢Á¾ ¿î¿µÃ¼Á¦¿¡¼­ÀÇ ³×Æ®¿öÅ© ¼³Ä¡¹ı
>          ¨è À¯Áö º¸¼ö°¡ °¡Àå °æÁ¦ÀûÀÎ ³×Æ®¿öÅ©À» ±¸¼ºÇÏ´Â ¹ı
>          ¨é ³×Æ®¿öÅ© °øÀ¯¸¦ ºñ·ÔÇÑ ½Ç¹«¿¡ °üÇÑ ¸ğµç Àç¹İÀûÀÎ ±â¼ú
>               ¸¦ ¹è¿ì°Ô µË´Ï´Ù
> 
>   - ½ºÄ«½Ã CD, DVD·¹ÄÚµù
>        ÇÏµå¿ş¾î ¼ÂÆÃÁß °¡Àå ±î´Ù·Î¿î ºĞ¾ß Áß ÇÏ³ªÀÎ ½ºÄ«½Ã ±â¼úÀ» »ó¼¼ÇÏ°Ô
>        ¸ğµÎ ¹è¿ì°Ô µË´Ï´Ù.  
>        °¢Á¾ ½ºÄ«½Ã ÀåºñÀÇ ¼ÂÆÃ¹ı Ãæµ¹ ¹æÁö¹ı ¹× »ç¿ë¹ıÀ» ¹è¿ì°Ô µË´Ï´Ù. 
>        ÃÖ±Ù µé¾î CD·¹ÄÚ´õ°¡ ºü¸¥ º¸±ŞÀ¸·Î °¡Àå °æÁ¦ÀûÀÌ°í ´É·üÀûÀÎ µ¥ÀÌÅÍ 
>        º¸°ü¼ö´ÜÀ¸·Î ÀÚ¸®Àâ¾Æ°¡°í ÀÖ½À´Ï´Ù.  CD·¹ÄÚ´õÀÇ ¼³Ä¡, ¼¼ÆÃ¹ı °¢Á¾
>        ¼ÒÇÁÆ®¿ş¾îÀÇ »ç¿ë¹ı, °í±Ş CD·¹ÄÚµù±â¼úµî ±ÍÇÏ¸¦ CD·¹ÄÚµùÀÇ Àü¹®°¡·Î 
>        ¸¸µé¾î µå¸³´Ï´Ù. 
> 
>   - Ã¢ ¾÷ Áö µµ
>        ±â¼úÀÌÀü±³À°À» ¹ŞÀ¸½Ã´Â ºĞµé Áß ¸¹Àº ºĞµéÀÌ ÄÄÇ»ÅÍ ºĞ¾ßÀÇ Ã¢¾÷À»
>        ¿øÇÏ½Ã°Å³ª Áö±İ ÇÏ°íÀÖ´Â ÄÄÇ»ÅÍ ºĞ¾ß »ç¾÷ÀÇ ºÎÁ·ÇÑ Á¡À» º¸ÃæÇÏ±â
>        À§ÇÑ ºĞµéÀÔ´Ï´Ù.  ¾Õ¼­µµ ¸»¾¸ µå·ÈÁö¸¸ Ã¢¾÷À» ÇÏ´Âµ¥ ¿Ü ±×·¸°Ôµµ
>        µ·ÀÌ ¸¹ÀÌ µì´Ï±î?    ÄÄÇ»ÅÍ °íÀå¼ö¸®Á¡ ÇÏ³ª Â÷¸®´Âµ¥ 3-4Ãµ¸¸¿øÀÌ 
>        µç´Ù´Ï ÀÌ°Ô ¸»ÀÌ³ª µË´Ï±î?  ÀúÈñ´Â °¡Àå °æÁ¦ÀûÀÌ°í È¿À²ÀûÀÎ Ã¢¾÷
>        ¹æ¹ıÀ» ÁöµµÇØ µå¸³´Ï´Ù.
>  
>  
> 
> ¢Â.  DVD°ü·Ã Àü¹®°¡ °úÁ¤ ±³À°
>           
>       1. ÄÄÇ»ÅÍ ±âº» ¿ø¸®
>            ¨ç ÄÄÇ»ÅÍ °í±Ş ¿ø·Ğ
>            ¨è ºñµğ¿À Ä«µå¿Í ¸ğ´ÏÅÍÀÇ ÀÛµ¿ ¿ø¸®
>            ¨é Á¤ÁöÈ­»ó, µ¿È­»óÀÇ »ı¼º ¹× Àü¼Û ¿ø¸®
>            ¨ê ¿Àµğ¿ÀÀÇ »ı¼º ¹× Àü¼Û ¿ø¸®
>          
>       2. °¢Á¾ ÄÚµ¦ÀÇ ¿ø¸®
>            ¨ç ºñµğ¿À
>                MPEG-1 (VCD)
>                MPEG-2 (DVD)
>                MPEG-4 (Divx, VKI, Wavelet, ASF, WMV)
>            ¨è ¿Àµğ¿À
>                PCM (pcm)
>                WAVE (wav)
>                MPEG 1, 2 (mpa)
>                MPEG 3 (mp3)
>                AC3 (ac3)
>                DTS
>                WMA (wma)µîµî
> 
> 
>       3. ¸ğµç ÄÚµ¦°£ÀÇ »óÈ£º¯È¯ ¹æ¹ı
>    
>                                             VCD.
>                 MPEG - 1.                               DVD.
>                                             Divx.
>                 MPEG - 2.       <====>                  VKI.
>                                             Wavelet.
>                 MPEG - 4.                               ASF.
>                                             WMV.
>           
>            - ÃÊ°íÈ­Áú(ÃÊÀú¿ë·®) MPEG4(Divx, VKI, WMV) Á¦ÀÛ¹ı
> 
> 
>       4. ¿µ»óÄÎÃÄ, ¿£ÄÚÆÃ µğÄÚµù, ÆíÁı  ¹× Æ¯¼öÈ¿°ú
>            ¨ç MPEG1,2,4 Ä¸ÃÄ, ¿£ÄÚµù, µğÄÚµù, ÆíÁı ¹× Æ¯¼öÈ¿°ú
>            ¨è Audio-Video Stream Multipelxing, Demultiplexing
> 
>       5. DVDÀÇ ±âº»¿ø¸®
>            ¨ç MPEG2, AC3, DTS, VOBÀÇ Æ¯¼º ¹× ¿ø¸®
>            ¨è Stream Multiplexing
>            ¨é ¸Ş´ºÁ¦ÀÛ¿¡ ÇÊ¿äÇÑ 2D ÀÛ¾÷
>            ¨ê ¸Ş´ºÁ¦ÀÛ¿¡ ÇÊ¿äÇÑ 3D ÀÛ¾÷
>            ¨ë Dolby Sound(2~5.1channel)ÀÇ ¿ø¸® ¹× ½Ç½À
> 
>       6. DVDÀÇ ¿À¼Ò¸µ
>            ¨ç Ç¥ÁØ - DVD Á¦ÀÛ¹ı
>            ¨è PC - DVD Á¦ÀÛ¹ı
>            ¨é Web - DVD Á¦ÀÛ¹ı
>   
>       7. DVD °í±Ş
>            ¨ç 3Â÷¿ø°ú Æ¯¼öÈ¿°ú¸¦ ÀÌ¿ëÇÑ °í³­µµ DVD Á¦ÀÛ¹ı
>            ¨è °ÔÀÓ DVD
>            ¨é DVD Programing
> 
> 
>   ¡Ü Solid_EYE°¡ ÇÏ´Â ÀÏ
> 
>      - Data º¹±¸
>            ¹ÙÀÌ·¯½º¸Ô°í ³¯¶ó°£ÇÏµå,°©ÀÚ±â ¸ÔÅëÀÎÇÏµå ¾Æ¹« »ı°¢ ¾øÀÌ 
>            FORMATÀÌ³ª FDISK·Ñ ³¯·Á¹ö¸° ÇÏµå ÀßµÇ´Ù ¾ÈµÇ´Â ¸À°£ ÇÃ·ÎÇÇ,
>            JAZZ Zip Driveµîµî ¹¹µçÁö  °¡Á®¿À¼¼¿ä.ÀúÈñ°¡ ¹ã»õ¼­ º¹±¸ÇØ
>            µå¸®´Ï±î¿ä
> 
>      - Data Á¦°Å
>            ¾î¶°ÇÑ °æ¿ì¿¡µµ Dataº¹±¸¸¦ ÇÒ¼ö¾ø°Ô ¿Ïº®ÇÏ°Ô Data¸¦ Á¦°ÅÇØ 
>            µå¸³´Ï´Ù.
>      
>      - °íÀå ¼ö¸® 
>            PCÀÇ ¾î¶°ÇÑ °íÀåÀÌ¶óµµ °íÃÄµå¸³´Ï´Ù.  ÀúÈñ°¡ ´Ù¸¥Á¡Àº ¹¹³Ä±¸¿ä.
>            ±³Ã¼°¡ ¾Æ´Ï¶ó ÁøÁ¤ÇÑ °íÀå¼ö¸®¸¦ ÇÑ´Ù´Â °Ì´Ï´Ù. 
>            ±³Ã¼´Â ´©°¡ ¸øÇÏ³ª! °íÀå¼ö¸®°¡ ¾Æ´Ï¶ó ±³Ã¼¼ö¸®¶ó°í ÇØ¾ßÇÏ³ª?                  
> 
>      - ±â¾÷Ã¼ ³×Æ®¿öÅ© ±¸Ãà
>            »ç³» ³×Æ®¿÷±¸Ãà ¹× ÀÎÅÍ³İ±¸Ãà  ³×Æ®¿÷À» ±¸ÃàÇÏ´Âµ¥ µ·ÀÌ ¸¹ÀÌ 
>            µç´Ù±¸¿ä? ÀúÈñ´Â °¡ÀåÀú·ÅÇÏ°í °­·ÂÇÑ ³×Æ®¿÷À» ±¸ÃàÇØµå¸³´Ï´Ù.  
> 
>      - ÄÄÇ»ÅÍ ºĞ¾ß »ó´ã
>            ¿À·£°æ·ÂÀÇ ½Ç¹«ÀÚµéÀÌ ÄÄÇ»ÅÍÀÇ °ÅÀÇ ¸ğµçºĞ¾ßÀÇ Á¶¾ğ ¹× ¹®Á¦ÇØ°á 
>            »ó´ãÀ» ÇØµå¸³´Ï´Ù
>      
>      - ±×·¡ÇÈ ¿¡´Ï¸ŞÀÌ¼Ç Á¦ÀÛ
>            ±¤°í ¹× ÇÁ·¹Á¨Å×ÀÌ¼Çµî¿¡ ÇÊ¿äÇÑ ¸ğµç 3Â÷¿ø ¿¡´Ï¸ŞÀÌ¼ÇÀ» Á¦ÀÛÇØ 
>            µå¸³´Ï´Ù. ±×¿Ü ±×·¡ÇÈ¿¡ °ü·ÃµÈ ¸ğµç ±â¼ú»ó´ãÀ» ÇØµå¸³´Ï´Ù
>  
>      - DVD ÆíÁı ¹× Á¦ÀÛ
>            ±¤°í, ¿µÈ­ DVD¿¡ °ü·ÃµÈ ÆíÁı, Æ¯¼öÈ¿°ú, ÀÚ¸·, ¿À¼Ò¸µ, 
>            Language,Copy Protection, Internet Link, µî ¸ğµç ÀÛ¾÷À» 
>            ÇØµå¸³´Ï´Ù.
> 
>      - ÀÎÅÍ³İ È¨ÆäÀÌÁö ±¸Ãà
>            ¿ì¸®³ª¶óÀÇ È¨ÆäÀÌÁö Á¦ÀÛ±â¼úÀÌ ¼¼°èÀûÀÌ¶ó´Â »ç½ÇÀ» ¾Ë°í °è½Ê´Ï±î? 
>            ÀúÈñ´Â ±×·¡ÇÈ°ú ÄÚµùÀÌ Á¶È­°¡µÈ ¿Ïº®ÇÑ È¨ÆäÀÌÁö¸¦ ±¸ÃàÇØµå¸³´Ï´Ù.
>            ¶ÇÇÑ ÀüÀÚ»ó°Å·¡¿¡ ÇÊ¿äÇÑ È¨ÆäÀÌÁö»óÀÇ µ¥ÀÌÅÍº£ÀÌ½º¸¦ °¡Àå 
>            Àú·³ÇÏ°í °­·ÂÇÏ°Ô ±¸ÃàÇØµå¸³´Ï´Ù. 
> 
> 
>    Çè³­ÇÑ ÄÄÇ»ÅÍ Àü¹®°¡ÀÇ±æ, ±×·¯³ª ´©±¸¿¡°Ô³ª °¡´ÉÇÕ´Ï´Ù********
>    DOS¸¦ Àß¸ğ¸£½Å´Ù±¸¿ä? ÁÖÀúÇÏÁö ¸¶½Ê½Ã¿À*************************
>    ÀúÈñ°¡ ±ÍÇÏ¸¦ Ã¥ÀÓÁ® µå¸®°Ú½À´Ï´Ù.ÀúÈñ°¡ ÀÌ²ø¾î µå¸®°Ú½À´Ï´Ù******
>    ÄÄÇ»ÅÍ ±â¼úÁö¿øÀü¹®È¸»ç  Solid_EYE**********************************
>    ÁöÇÏÃ¶ 2È£¼± ¼­ÃÊ¿ª  Á÷Åë¹®ÀÇÀüÈ­:523-7881****************************
>    ¹®ÀÇ »çÇ× : bruma6@korea.com*******************************************
> 
Hi,

who do you think will understand you?
ı:.Ë›±Êâmçë¢kaŠÉb²ßìzwm…ébïîË›±Êâmébìÿ‘êçz_âØ^n‡r¡ö¦zËëh™¨è­Ú&£ûàz¿äz¹Ş—ú+€Ê+zf£¢·hšˆ§~†­†Ûiÿÿïêÿ‘êçz_è®æj:+v‰¨ş)ß£ømšSåy«­æ¶…­†ÛiÿÿğÃí»è®å’i
